Catalogs/ПараметрыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ПараметрыСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантАлгоритмаБюджета</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПараметрыСистемы/Ext/ManagerModule.bsl
Процедура УстановитьНастройкиПоУмолчанию() Экспорт
	
	
	НаборЗаписей = РегистрыСведений.НастройкиСистемы.СоздатьНаборЗаписей();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.Автобэкап;
	НоваяЗапись.Значение = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.ОблачныйБэкап;
	НоваяЗапись.Значение = Ложь;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.АвтоматическиОтправлятьОшибки;
	НоваяЗапись.Значение = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.ВариантРасчетаБюджета;
	НоваяЗапись.Значение = Перечисления.ВариантАлгоритмаБюджета.Вариант2;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.ОтправлятьЛоги;
	НоваяЗапись.Значение = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.ОтправлятьСтатистику;
	НоваяЗапись.Значение = Ложь;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Параметр = Справочники.ПараметрыСистемы.УведомлятьОПревышенииБюджета;
	НоваяЗапись.Значение = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьНовоеЗначениеПараметраСистемы(Параметр, Значение) Экспорт
	
	Попытка
		
		спрПараметр = Справочники.ПараметрыСистемы.НайтиПоНаименованию(Параметр);
		
		МенеджерЗаписи = РегистрыСведений.НастройкиСистемы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Параметр = спрПараметр;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если МенеджерЗаписи.Значение = Значение Тогда
				Возврат;
			Иначе
				МенеджерЗаписи.Значение = Значение;
			КонецЕсли;
			
		Иначе
			МенеджерЗаписи.Параметр = спрПараметр;
			МенеджерЗаписи.Значение = Значение;
		КонецЕсли;
		МенеджерЗаписи.Записать();
	Исключение
		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщиеПроцедурыИФункцииСервер.ЗаписатьЛоги(Ошибка);
	КонецПопытки;
	
КонецПроцедуры


// Получить значения параметров.
// 
// Параметры:
//  МассивПараметров - Массив - Массив со списком запрашиваемых параметров.
// *Строка 
// 
// Возвращаемое значение - Массив

Функция ПолучитьЗначенияПараметров(МассивПараметров) Экспорт
		
	Если Не ЗначениеЗаполнено(МассивПараметров) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСтруктурПараметров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемы.Параметр КАК Параметр,
	               |	НастройкиСистемы.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
	               |ГДЕ
	               |	НастройкиСистемы.Параметр В(&Параметр)";
	
	Запрос.УстановитьПараметр("Параметр", МассивПараметров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структурапараметров = Новый Структура("Параметр, Значение");
		ЗаполнитьЗначенияСвойств(Структурапараметров, ВыборкаДетальныеЗаписи);
		массивСтруктурПараметров.Добавить(Структурапараметров);
	КонецЦикла;
	
	Возврат массивСтруктурПараметров;
	
КонецФункции
